# UpdateFailureMultiple Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PathOfTravelFailures..::..UpdateFailureMultiple Property
BuiltInFailures..::..PathOfTravelFailures Class See Also
---
[Number] Path of Travel lines failed to update. [Reason for failure]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UpdateFailureMultiple { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UpdateFailureMultiple As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UpdateFailureMultiple {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PathOfTravelFailures Class
Autodesk.Revit.DB Namespace